Repository: batonogov/pine
Catalog: Pine/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans

# terminal.tabCloseWarning.message
source: Terminal has an active process. Close anyway?
de: Das Terminal hat einen aktiven Prozess. Trotzdem schließen?
es: El terminal tiene un proceso activo. ¿Cerrar de todas formas?
fr: Le terminal a un processus actif. Fermer quand même ?
ja: ターミナルでアクティブなプロセスが実行中です。それでも閉じますか？
ko: 터미널에 활성 프로세스가 있습니다. 그래도 닫으시겠습니까?
pt_br: O terminal tem um processo ativo. Fechar mesmo assim?
ru: В терминале запущен активный процесс. Всё равно закрыть?
zh_hans: 终端有活跃进程。仍然关闭？

# terminal.tabCloseWarning.title
source: Active Process
de: Aktiver Prozess
es: Proceso activo
fr: Processus actif
ja: アクティブなプロセス
ko: 활성 프로세스
pt_br: Processo ativo
ru: Активный процесс
zh_hans: 活跃进程

# terminal.toggle
source: Toggle Terminal
de: Terminal ein-/ausblenden
es: Mostrar/ocultar terminal
fr: Afficher/masquer le terminal
ja: ターミナルの表示切替
ko: 터미널 전환
pt_br: Alternar terminal
ru: Показать/скрыть терминал
zh_hans: 切换终端

# toast.fileReloaded %@
source: %@ reloaded
de: %@ wurde neu geladen
es: %@ recargado
fr: %@ rechargé
ja: %@ を再読み込みしました
ko: %@ 다시 불러옴
pt_br: %@ recarregado
ru: %@ перезагружен
zh_hans: %@ 已重新加载

# toast.filesReloaded %lld %@
source: %1$lld files reloaded: %2$@
de: %1$lld Dateien neu geladen: %2$@
es: %1$lld archivos recargados: %2$@
fr: %1$lld fichiers rechargés : %2$@
ja: %1$lld 個のファイルを再読み込み: %2$@
ko: %1$lld개 파일 다시 불러옴: %2$@
pt_br: %1$lld arquivos recarregados: %2$@
ru: %1$lld файлов перезагружено: %2$@
zh_hans: 已重新加载 %1$lld 个文件：%2$@

# toast.filesReloaded.more %lld %@ %lld
source: %1$lld files reloaded: %2$@ and %3$lld more
de: %1$lld Dateien neu geladen: %2$@ und %3$lld weitere
es: %1$lld archivos recargados: %2$@ y %3$lld más
fr: %1$lld fichiers rechargés : %2$@ et %3$lld autres
ja: %1$lld 個のファイルを再読み込み: %2$@ 他%3$lld個
ko: %1$lld개 파일 다시 불러옴: %2$@ 외 %3$lld개
pt_br: %1$lld arquivos recarregados: %2$@ e mais %3$lld
ru: %1$lld файлов перезагружено: %2$@ и ещё %3$lld
zh_hans: 已重新加载 %1$lld 个文件：%2$@ 及另外 %3$lld 个

# undo.create
source: Create
de: Erstellen
es: Crear
fr: Créer
ja: 作成
ko: 생성
pt_br: Criar
ru: Создание
zh_hans: 创建

# undo.delete
source: Delete
de: Löschen
es: Eliminar
fr: Supprimer
ja: 削除
ko: 삭제
pt_br: Excluir
ru: Удаление
zh_hans: 删除

# undo.rename
source: Rename
de: Umbenennen
es: Renombrar
fr: Renommer
ja: 名前変更
ko: 이름 변경
pt_br: Renomear
ru: Переименование
zh_hans: 重命名

source: Uninstall Command Line Tool…
de: Befehlszeilenwerkzeug deinstallieren…
es: Desinstalar herramienta de línea de comandos…
fr: Désinstaller l’outil en ligne de commande…
ja: コマンドラインツールをアンインストール…
ko: 명령줄 도구 제거…
pt_br: Desinstalar ferramenta de linha de comando…
ru: Удалить инструмент командной строки…
zh_hans: 卸载命令行工具…

# validation.errorCount %lld
source: %lld errors
de: %lld Fehler
es: %lld errores
fr: %lld erreurs
ja: %lld件のエラー
ko: %lld개 오류
pt_br: %lld erros
ru: %lld ошибок
zh_hans: %lld个错误

source: Validation passed
de: Validierung bestanden
es: Validación exitosa
fr: Validation réussie
ja: バリデーション合格
ko: 유효성 검사 통과
pt_br: Validação aprovada
ru: Валидация пройдена
zh_hans: 验证通过

# validation.toolNotInstalled %@
source: %@ is not installed
de: %@ ist nicht installiert
es: %@ no está instalado
fr: %@ n'est pas installé
ja: %@がインストールされていません
ko: %@가 설치되지 않았습니다
pt_br: %@ não está instalado
ru: %@ не установлен
zh_hans: %@未安装

# validation.warningCount %lld
source: %lld warnings
de: %lld Warnungen
es: %lld advertencias
fr: %lld avertissements
ja: %lld件の警告
ko: %lld개 경고
pt_br: %lld avisos
ru: %lld предупреждений
zh_hans: %lld个警告

# welcome.noRecent
source: No Recent Projects
de: Keine letzten Projekte
es: Sin proyectos recientes
fr: Aucun projet récent
ja: 最近のプロジェクトはありません
ko: 최근 프로젝트 없음
pt_br: Nenhum projeto recente
ru: Нет недавних проектов
zh_hans: 没有最近的项目

# welcome.noSearchResults
source: No Matching Projects
de: Keine passenden Projekte
es: No hay proyectos coincidentes
fr: Aucun projet correspondant
ja: 一致するプロジェクトはありません
ko: 일치하는 프로젝트 없음
pt_br: Nenhum projeto correspondente
ru: Нет подходящих проектов
zh_hans: 没有匹配的项目

# welcome.recentProjects
source: Recent Projects
de: Letzte Projekte
es: Proyectos recientes
fr: Projets récents
ja: 最近のプロジェクト
ko: 최근 프로젝트
pt_br: Projetos recentes
ru: Недавние проекты
zh_hans: 最近的项目

# welcome.removeFromRecent
source: Remove from Recent Projects
de: Aus letzten Projekten entfernen
es: Eliminar de proyectos recientes
fr: Supprimer des projets récents
ja: 最近のプロジェクトから削除
ko: 최근 프로젝트에서 제거
pt_br: Remover dos projetos recentes
ru: Удалить из недавних
zh_hans: 从最近项目中移除

# welcome.revealInFinder
source: Reveal in Finder
de: Im Finder anzeigen
es: Mostrar en Finder
fr: Afficher dans le Finder
ja: Finderで表示
ko: Finder에서 보기
pt_br: Revelar no Finder
ru: Показать в Finder
zh_hans: 在访达中显示

# welcome.searchPlaceholder
source: Filter projects…
de: Projekte filtern…
es: Filtrar proyectos…
fr: Filtrer les projets…
ja: プロジェクトを検索…
ko: 프로젝트 검색…
pt_br: Filtrar projetos…
ru: Фильтр проектов…
zh_hans: 筛选项目…

# welcome.subtitle
source: A code editor that belongs on your Mac.
de: Ein Code-Editor, der auf Ihren Mac gehört.
es: Un editor de código hecho para tu Mac.
fr: Un éditeur de code fait pour votre Mac.
ja: あなたのMacにふさわしいコードエディタ。
ko: 당신의 Mac에 어울리는 코드 편집기.
pt_br: Um editor de código feito para o seu Mac.
ru: Редактор кода, созданный для вашего Mac.
zh_hans: 属于你 Mac 的代码编辑器。

# welcome.title
source: Welcome to Pine
de: Willkommen bei Pine
es: Bienvenido a Pine
fr: Bienvenue dans Pine
ja: Pine へようこそ
ko: Pine에 오신 것을 환영합니다
pt_br: Bem-vindo ao Pine
ru: Добро пожаловать в Pine
zh_hans: 欢迎使用 Pine

# a11y.editorTab.preview.value
source: Preview
de: Vorschau
es: Vista previa
fr: Aperçu
ja: プレビュー
ko: 미리보기
pt_br: Pré-visualização
ru: Предпросмотр
zh_hans: 预览

# a11y.sidebar.disclosure.expanded
source: expanded
de: ausgeklappt
es: expandido
fr: déplié
ja: 展開済み
ko: 펼침
pt_br: expandido
ru: развёрнут
zh_hans: 已展开

# a11y.sidebar.disclosure.collapsed
source: collapsed
de: eingeklappt
es: colapsado
fr: replié
ja: 折りたたみ済み
ko: 접힘
pt_br: recolhido
ru: свёрнут
zh_hans: 已折叠

# a11y.sidebar.folder.hint
source: Folder. Press Left or Right arrow to collapse or expand.
de: Ordner. Zum Ein- oder Ausklappen Links- oder Rechts-Taste drücken.
es: Carpeta. Pulsa Izquierda o Derecha para colapsar o expandir.
fr: Dossier. Appuyez sur Flèche gauche ou droite pour replier ou déplier.
ja: フォルダ。展開または折りたたむには左矢印または右矢印を押してください。
ko: 폴더입니다. 접거나 펼치려면 왼쪽 또는 오른쪽 화살표를 누르십시오.
pt_br: Pasta. Pressione Esquerda ou Direita para recolher ou expandir.
ru: Папка. Нажмите стрелку влево или вправо, чтобы свернуть или развернуть.
zh_hans: 文件夹。按左箭头或右箭头可折叠或展开。

# a11y.sidebar.expand.action
source: Expand
de: Ausklappen
es: Expandir
fr: Déplier
ja: 展開
ko: 펼치기
pt_br: Expandir
ru: Развернуть
zh_hans: 展开

# a11y.sidebar.collapse.action
source: Collapse
de: Einklappen
es: Colapsar
fr: Replier
ja: 折りたたむ
ko: 접기
pt_br: Recolher
ru: Свернуть
zh_hans: 折叠

# a11y.sidebar.file.open.hint
source: Double-click or press Command-Return to keep this file open
de: Doppelklicken oder Befehl-Eingabe drücken, um diese Datei geöffnet zu lassen
es: Haz doble clic o pulsa Comando-Retorno para mantener este archivo abierto
fr: Double-cliquez ou appuyez sur Commande-Retour pour garder ce fichier ouvert
ja: ダブルクリックするかCommand-Returnキーを押すと、このファイルを開いたままにします
ko: 이 파일을 계속 열어 두려면 이중 클릭하거나 Command-Return을 누르십시오
pt_br: Clique duas vezes ou pressione Comando-Retorno para manter este arquivo aberto
ru: Дважды щёлкните или нажмите Command-Return, чтобы оставить файл открытым
zh_hans: 双击或按下 Command-Return 可使此文件保持打开

# a11y.sidebar.file.preview.action
source: Open Preview
de: Vorschau öffnen
es: Abrir vista previa
fr: Ouvrir l’aperçu
ja: プレビューを開く
ko: 미리보기 열기
pt_br: Abrir pré-visualização
ru: Открыть предпросмотр
zh_hans: 打开预览

# a11y.toast.announcement.prefix
source: Notification:
de: Benachrichtigung:
es: Notificación:
ja: 通知：
ko: 알림:
pt_br: Notificação:
ru: Уведомление:
zh_hans: 通知：

# a11y.toast.dismiss.label
source: Dismiss
de: Schließen
es: Cerrar
fr: Fermer
ja: 閉じる
ko: 닫기
pt_br: Dispensar
ru: Закрыть
zh_hans: 关闭

# menu.tasks
source: Tasks
de: Aufgaben
es: Tareas
fr: Tâches
ja: タスク
ko: 작업
pt_br: Tarefas
ru: Задачи
zh_hans: 任务

# menu.tasksEmpty
source: No Tasks Configured
de: Keine Aufgaben konfiguriert
es: No hay tareas configuradas
fr: Aucune tâche configurée
ja: タスクが設定されていません
ko: 구성된 작업이 없음
pt_br: Nenhuma tarefa configurada
ru: Задачи не настроены
zh_hans: 未配置任务

# menu.editKeybindings
source: Edit Keybindings…
de: Tastaturkurzbefehle bearbeiten …
es: Editar atajos de teclado…
fr: Modifier les raccourcis clavier…
ja: キーバインドを編集…
ko: 단축키 편집…
pt_br: Editar Atalhos de Teclado…
ru: Изменить сочетания клавиш…
zh_hans: 编辑快捷键…

# menu.editTasks
source: Edit Tasks…
de: Aufgaben bearbeiten …
es: Editar tareas…
fr: Modifier les tâches…
ja: タスクを編集…
ko: 작업 편집…
pt_br: Editar Tarefas…
ru: Изменить задачи…
zh_hans: 编辑任务…

# menu.reloadUserConfiguration
source: Reload User Configuration
de: Benutzerkonfiguration neu laden
es: Recargar configuración de usuario
fr: Recharger la configuration utilisateur
ja: ユーザ設定を再読み込み
ko: 사용자 설정 다시 불러오기
pt_br: Recarregar Configuração do Usuário
ru: Перезагрузить конфигурацию пользователя
zh_hans: 重新加载用户配置

# userConfig.openFailed.title
source: Couldn’t open configuration file
de: Konfigurationsdatei konnte nicht geöffnet werden
es: No se pudo abrir el archivo de configuración
fr: Impossible d’ouvrir le fichier de configuration
ja: 設定ファイルを開けませんでした
ko: 구성 파일을 열 수 없습니다
pt_br: Não foi possível abrir o arquivo de configuração
ru: Не удалось открыть файл конфигурации
zh_hans: 无法打开配置文件

# userConfig.openFailed.message
source: Pine could not open the %@ configuration file in its default editor.
de: Pine konnte die %@-Konfigurationsdatei nicht im Standardeditor öffnen.
es: Pine no pudo abrir el archivo de configuración %@ en el editor predeterminado.
fr: Pine n’a pas pu ouvrir le fichier de configuration %@ dans l’éditeur par défaut.
ja: Pine は %@ 設定ファイルをデフォルトのエディタで開けませんでした。
ko: Pine이 %@ 구성 파일을 기본 편집기에서 열 수 없습니다.
pt_br: O Pine não pôde abrir o arquivo de configuração %@ no editor padrão.
ru: Pine не удалось открыть файл конфигурации %@ в редакторе по умолчанию.
zh_hans: Pine 无法在默认编辑器中打开 %@ 配置文件。

# userConfig.reloadSuccess.title
source: Configuration reloaded
de: Konfiguration neu geladen
es: Configuración recargada
fr: Configuration rechargée
ja: 設定を再読み込みしました
ko: 구성을 다시 불러왔습니다
pt_br: Configuração recarregada
ru: Конфигурация перезагружена
zh_hans: 配置已重新加载

# userConfig.reloadSuccess.message
source: %1$lld tasks and %2$lld keybindings active.
de: %1$lld Aufgaben und %2$lld Tastaturkurzbefehle aktiv.
es: %1$lld tareas y %2$lld atajos activos.
fr: %1$lld tâches et %2$lld raccourcis actifs.
ja: %1$lld 個のタスクと %2$lld 個のキーバインドがアクティブです。
ko: %1$lld개 작업과 %2$lld개 단축키가 활성화되어 있습니다.
pt_br: %1$lld tarefas e %2$lld atalhos ativos.
ru: Активно задач: %1$lld, сочетаний клавиш: %2$lld.
zh_hans: %1$lld 个任务和 %2$lld 个快捷键已启用。

# userConfig.reloadRejected.title
source: Configuration problems found
de: Konfigurationsprobleme gefunden
es: Se encontraron problemas de configuración
fr: Problèmes de configuration détectés
ja: 設定に問題が見つかりました
ko: 구성 문제가 발견됨
pt_br: Problemas de configuração encontrados
ru: Обнаружены проблемы в конфигурации
zh_hans: 发现配置问题

# userConfig.reloadRejected.header
source: Some entries were rejected. Each rejected file kept its previous valid configuration. Fix the file and reload again.
de: Einige Einträge wurden abgelehnt. Jede abgelehnte Datei behielt ihre vorherige gültige Konfiguration. Korrigieren Sie die Datei und laden Sie erneut.
es: Se rechazaron algunas entradas. Cada archivo rechazado conservó su configuración válida anterior. Corrija el archivo y vuelva a cargar.
fr: Certaines entrées ont été rejetées. Chaque fichier rejeté a conservé sa configuration valide précédente. Corrigez le fichier et rechargez.
ja: 一部のエントリが拒否されました。拒否された各ファイルでは以前の有効な設定が維持されています。ファイルを修正して再度読み込んでください。
ko: 일부 항목이 거부되었습니다. 거부된 각 파일은 이전의 유효한 구성을 유지했습니다. 파일을 수정하고 다시 불러오세요.
pt_br: Algumas entradas foram rejeitadas. Cada arquivo rejeitado manteve sua configuração válida anterior. Corrija o arquivo e recarregue.
ru: Некоторые записи отклонены. Для каждого отклонённого файла сохранена предыдущая рабочая конфигурация. Исправьте файл и перезагрузите.
zh_hans: 部分条目被拒绝。每个被拒绝的文件都保留了之前的有效配置。请修正文件后重新加载。

# userConfig.starterCreateFailed.title
source: Couldn’t create configuration file
de: Konfigurationsdatei konnte nicht erstellt werden
es: No se pudo crear el archivo de configuración
fr: Impossible de créer le fichier de configuration
ja: 設定ファイルを作成できませんでした
ko: 구성 파일을 만들 수 없습니다
pt_br: Não foi possível criar o arquivo de configuração
ru: Не удалось создать файл конфигурации
zh_hans: 无法创建配置文件

# userConfig.starterCreateFailed.message
source: Pine could not create the %@ configuration file: %@
de: Pine konnte die %@-Konfigurationsdatei nicht erstellen: %@
es: Pine no pudo crear el archivo de configuración %@: %@
fr: Pine n’a pas pu créer le fichier de configuration %@ : %@
ja: Pine は %@ 設定ファイルを作成できませんでした: %@
ko: Pine이 %@ 구성 파일을 만들 수 없습니다: %@
pt_br: O Pine não pôde criar o arquivo de configuração %@: %@
ru: Pine не удалось создать файл конфигурации %@: %@
zh_hans: Pine 无法创建 %@ 配置文件: %@

# userConfig.starter.keybindingsComment
source: Pine keybindings. Add entries to the "keybindings" array below. Each entry maps a command id to a key chord. Supported command ids are listed after this guidance. Chords use lowercase modifiers joined by '+': cmd (or command), shift, alt (or option/opt), ctrl (or control), plus one key (for example 'f', 'return', or 'up'). A dispatch modifier (cmd or ctrl) is required. Reserved system chords and plain text input are rejected.
de: Pine-Tastaturkurzbefehle. Fügen Sie unten Einträge zum Array "keybindings" hinzu. Jeder Eintrag ordnet eine Befehlskennung einer Tastenkombination zu. Die unterstützten Befehlskennungen folgen nach diesem Hinweis. Tastenkombinationen verwenden kleingeschriebene, durch '+' verbundene Modifikatoren: cmd (oder command), shift, alt (oder option/opt), ctrl (oder control) und eine Taste (zum Beispiel 'f', 'return' oder 'up'). Ein Dispatch-Modifikator (cmd oder ctrl) ist erforderlich. Reservierte Systemkombinationen und normale Texteingaben werden abgelehnt.
es: Atajos de Pine. Añada entradas al array "keybindings" de abajo. Cada entrada asocia un id de comando con una combinación de teclas. Los id. de comando compatibles aparecen después de esta guía. Las combinaciones usan modificadores en minúsculas unidos por '+': cmd (o command), shift, alt (u option/opt), ctrl (o control), más una tecla (por ejemplo, 'f', 'return' o 'up'). Se requiere un modificador de despacho (cmd o ctrl). Se rechazan las combinaciones reservadas del sistema y la entrada de texto normal.
fr: Raccourcis clavier de Pine. Ajoutez des entrées au tableau "keybindings" ci-dessous. Chaque entrée associe un identifiant de commande à une combinaison de touches. Les identifiants pris en charge suivent ces instructions. Les combinaisons utilisent des modificateurs en minuscules reliés par '+' : cmd (ou command), shift, alt (ou option/opt), ctrl (ou control), plus une touche (par exemple 'f', 'return' ou 'up'). Un modificateur de répartition (cmd ou ctrl) est requis. Les combinaisons système réservées et la saisie de texte normale sont rejetées.
ja: Pine のキーバインド。下の "keybindings" 配列にエントリを追加してください。各エントリはコマンド ID をキーの組み合わせに割り当てます。対応するコマンド ID はこの説明の後に一覧表示されます。キーの組み合わせは小文字の修飾キーを '+' で連結します: cmd (または command)、shift、alt (または option/opt)、ctrl (または control) と 1 つのキー (例: 'f'、'return'、'up')。ディスパッチ修飾キー (cmd または ctrl) が必要です。システムで予約された組み合わせと通常のテキスト入力は拒否されます。
ko: Pine 단축키. 아래 "keybindings" 배열에 항목을 추가하세요. 각 항목은 명령 ID를 키 조합에 연결합니다. 지원되는 명령 ID는 이 안내 뒤에 나열됩니다. 키 조합은 소문자 보조 키를 '+'로 연결합니다: cmd(또는 command), shift, alt(또는 option/opt), ctrl(또는 control)과 하나의 키(예: 'f', 'return', 'up'). 디스패치 보조 키(cmd 또는 ctrl)가 필요합니다. 시스템 예약 조합과 일반 텍스트 입력은 거부됩니다.
pt_br: Atalhos de teclado do Pine. Adicione entradas ao array "keybindings" abaixo. Cada entrada associa um id de comando a uma combinação de teclas. Os IDs de comando compatíveis aparecem após estas instruções. As combinações usam modificadores em minúsculas unidos por '+': cmd (ou command), shift, alt (ou option/opt), ctrl (ou control), mais uma tecla (por exemplo, 'f', 'return' ou 'up'). Um modificador de despacho (cmd ou ctrl) é obrigatório. Combinações reservadas do sistema e entrada de texto normal são rejeitadas.
ru: Сочетания клавиш Pine. Добавляйте записи в массив "keybindings" ниже. Каждая запись связывает идентификатор команды с сочетанием клавиш. Поддерживаемые идентификаторы команд перечислены после этой подсказки. В сочетаниях используются строчные модификаторы, соединённые знаком '+': cmd (или command), shift, alt (или option/opt), ctrl (или control) и одна клавиша (например, 'f', 'return' или 'up'). Требуется модификатор диспетчеризации (cmd или ctrl). Зарезервированные системные сочетания и обычный текстовый ввод отклоняются.
zh_hans: Pine 快捷键。请在下面的 "keybindings" 数组中添加条目。每个条目将命令 ID 映射到按键组合。支持的命令 ID 会列在本说明之后。按键组合使用以 '+' 连接的小写修饰键：cmd（或 command）、shift、alt（或 option/opt）、ctrl（或 control），再加一个按键（例如 'f'、'return' 或 'up'）。必须包含分派修饰键（cmd 或 ctrl）。系统保留的组合和普通文本输入会被拒绝。

# userConfig.starter.tasksComment
source: Pine tasks. Add entries to the "tasks" array below. Each task runs a shell command. Fields: id (unique), label (menu text), command (shell string), scope (activeFile or project; default activeFile), replaces_file_content (default false; when true in activeFile scope, Pine sends the current file content to stdin and applies stdout only if the same editor buffer is still unchanged), require_confirmation (default auto; destructive commands such as rm, chmod, dd, and diskutil prompt for confirmation).
de: Pine-Aufgaben. Fügen Sie unten Einträge zum Array "tasks" hinzu. Jede Aufgabe führt einen Shell-Befehl aus. Felder: id (eindeutig), label (Menütext), command (Shell-Zeichenfolge), scope (activeFile oder project; Standard activeFile), replaces_file_content (Standard false; bei true im Bereich activeFile sendet Pine den aktuellen Dateiinhalt an stdin und übernimmt stdout nur, wenn derselbe Editorpuffer unverändert ist), require_confirmation (Standard automatisch; destruktive Befehle wie rm, chmod, dd und diskutil verlangen eine Bestätigung).
es: Tareas de Pine. Añada entradas al array "tasks" de abajo. Cada tarea ejecuta un comando de shell. Campos: id (único), label (texto del menú), command (cadena de shell), scope (activeFile o project; predeterminado activeFile), replaces_file_content (predeterminado false; cuando es true con ámbito activeFile, Pine envía el contenido actual a stdin y aplica stdout solo si el mismo búfer sigue sin cambios), require_confirmation (predeterminado automático; los comandos destructivos como rm, chmod, dd y diskutil solicitan confirmación).
fr: Tâches Pine. Ajoutez des entrées au tableau "tasks" ci-dessous. Chaque tâche exécute une commande shell. Champs : id (unique), label (texte du menu), command (chaîne shell), scope (activeFile ou project ; activeFile par défaut), replaces_file_content (false par défaut ; avec true et la portée activeFile, Pine envoie le contenu actuel à stdin et applique stdout uniquement si le même tampon est resté inchangé), require_confirmation (automatique par défaut ; les commandes destructrices telles que rm, chmod, dd et diskutil demandent une confirmation).
ja: Pine のタスク。下の "tasks" 配列にエントリを追加してください。各タスクはシェルコマンドを実行します。フィールド: id (一意)、label (メニューのテキスト)、command (シェル文字列)、scope (activeFile または project、デフォルトは activeFile)、replaces_file_content (デフォルトは false。activeFile スコープで true の場合、現在の内容を stdin に送り、同じエディターバッファーが未変更のときだけ stdout を適用します)、require_confirmation (デフォルトは自動。rm、chmod、dd、diskutil などの破壊的なコマンドでは確認を求めます)。
ko: Pine 작업. 아래 "tasks" 배열에 항목을 추가하세요. 각 작업은 셸 명령을 실행합니다. 필드: id(고유), label(메뉴 텍스트), command(셸 문자열), scope(activeFile 또는 project, 기본값 activeFile), replaces_file_content(기본값 false, activeFile 범위에서 true이면 현재 내용을 stdin으로 보내고 같은 편집기 버퍼가 변경되지 않았을 때만 stdout을 적용함), require_confirmation(기본값 자동, rm, chmod, dd, diskutil 같은 파괴적 명령은 확인을 요청함).
pt_br: Tarefas do Pine. Adicione entradas ao array "tasks" abaixo. Cada tarefa executa um comando de shell. Campos: id (único), label (texto do menu), command (string de shell), scope (activeFile ou project; padrão activeFile), replaces_file_content (padrão false; quando true no escopo activeFile, o Pine envia o conteúdo atual para stdin e aplica stdout apenas se o mesmo buffer continuar inalterado), require_confirmation (padrão automático; comandos destrutivos como rm, chmod, dd e diskutil solicitam confirmação).
ru: Задачи Pine. Добавляйте записи в массив "tasks" ниже. Каждая задача выполняет команду оболочки. Поля: id (уникальный), label (текст меню), command (строка оболочки), scope (activeFile или project; по умолчанию activeFile), replaces_file_content (по умолчанию false; при true и области activeFile Pine передаёт текущее содержимое в stdin и применяет stdout, только если тот же буфер редактора не изменился), require_confirmation (по умолчанию автоматически; разрушительные команды, например rm, chmod, dd и diskutil, требуют подтверждения).
zh_hans: Pine 任务。请在下面的 "tasks" 数组中添加条目。每个任务运行一条 shell 命令。字段：id（唯一）、label（菜单文本）、command（shell 字符串）、scope（activeFile 或 project；默认为 activeFile）、replaces_file_content（默认为 false；在 activeFile 范围内设为 true 时，将当前内容发送到 stdin，并且仅在同一编辑器缓冲区仍未更改时应用 stdout）、require_confirmation（默认为自动；rm、chmod、dd 和 diskutil 等破坏性命令会请求确认）。

# userConfig.diagnostic.entryPrefix
source: entry %lld —
de: Eintrag %lld —
es: entrada %lld —
fr: entrée %lld —
ja: エントリ %lld —
ko: 항목 %lld —
pt_br: entrada %lld —
ru: запись %lld —
zh_hans: 条目 %lld —

# userConfig.diagnostic.unreadable
source: The file could not be read (%@).
de: Die Datei konnte nicht gelesen werden (%@).
es: No se pudo leer el archivo (%@).
fr: Le fichier n’a pas pu être lu (%@).
ja: ファイルを読み込めませんでした (%@)。
ko: 파일을 읽을 수 없습니다 (%@).
pt_br: Não foi possível ler o arquivo (%@).
ru: Не удалось прочитать файл (%@).
zh_hans: 无法读取文件 (%@)。

# userConfig.diagnostic.malformed
source: The JSON document is invalid (%@).
de: Das JSON-Dokument ist ungültig (%@).
es: El documento JSON no es válido (%@).
fr: Le document JSON n’est pas valide (%@).
ja: JSON ドキュメントが無効です (%@)。
ko: JSON 문서가 올바르지 않습니다 (%@).
pt_br: O documento JSON é inválido (%@).
ru: Документ JSON некорректен (%@).
zh_hans: JSON 文档无效 (%@)。

# userConfig.diagnostic.unknownCommand
source: “%@” is not a known Pine command id.
de: „%@“ ist keine bekannte Pine-Befehlskennung.
es: «%@» no es un id de comando de Pine conocido.
fr: « %@ » n’est pas un identifiant de commande Pine connu.
ja: 「%@」は Pine のコマンド ID ではありません。
ko: “%@”은(는) 알려진 Pine 명령 ID가 아닙니다.
pt_br: “%@” não é um id de comando do Pine conhecido.
ru: «%@» — неизвестный идентификатор команды Pine.
zh_hans: “%@” 不是已知的 Pine 命令 ID。

# userConfig.diagnostic.unavailableCommand
source: “%@” has no safe dispatcher and cannot be bound.
de: „%@“ hat keinen sicheren Dispatcher und kann nicht zugewiesen werden.
es: «%@» no tiene un despachador seguro y no se puede asignar.
fr: « %@ » n’a pas de répartiteur sûr et ne peut pas être lié.
ja: 「%@」には安全なディスパッチャーがなく、割り当てできません。
ko: “%@”은(는) 안전한 디스패처가 없어 바인딩할 수 없습니다.
pt_br: “%@” não tem um despachante seguro e não pode ser vinculado.
ru: У «%@» нет безопасного диспетчера, привязка невозможна.
zh_hans: “%@” 没有安全的调度器，无法绑定。

# userConfig.diagnostic.invalidChord
source: “%@” is not a valid key chord.
de: „%@“ ist kein gültiger Tastenakkord.
es: «%@» no es un acorde de tecla válido.
fr: « %@ » n’est pas un accord de touche valide.
ja: 「%@」は有効なキーコードではありません。
ko: “%@”은(는) 올바른 키 코드가 아닙니다.
pt_br: “%@” não é um acorde de tecla válido.
ru: «%@» — недопустимое сочетание клавиш.
zh_hans: “%@” 不是有效的按键组合。
